[{
  "section": "obj",
  "highlights": [{
    "tagLines": ["Spreading excitement and energy in human-centered design through innovative applications of modern open source technology and automation."]
  }]
}, {
  "section": "job",
  "highlights": [{
    "job": "Sr. Software Engineer & Tech Lead",
    "loc": "Richmond, VA",
    "level": "Sr. Associate",
    "company": "Capital One",
    "timeFrame": "Oct 2013 - Present",
    "qualifiers": [
      "Responsible for automating, configuring, staging, and versioning all code for the team via CI/CD platform",
      "Developed our team's automated DevOps pipeline to work within Capital One's secure architecture",
      "Worked successfully in mature Scrum and Kanban agile environments",
      "Created human-centered, web-based interfaces to help visualize and manage various scaled agile-related processes using open sourced technology",
      "Utilized and created various micro-service, enterprise, and external web APIs",
      "Developed on MVC (model-view-controller) platform using open sourced technology stack",
      "Responsible and trusted for educating, breifing, and providing keynotes to non-technical persons and leadership on technical subject matter",
      "Frequently provided feedback to external agile content management software company regarding Capital One's end-user experience"
    ],
    "achievements": [
      "<em>Notable Achievements:</em> Contributed substantially to Capital One's first open sourced product &ndash; <a target='_blank' href='https://github.com/capitalone/Hygieia'>Hygieia</a> &ndash; released during OSCON 2015"
    ]
  }, {
    "job": "Process Manager",
    "loc": "Richmond, VA",
    "level": "Associate",
    "company": "Capital One",
    "timeFrame": "Jun 2012 - Oct 2013",
    "qualifiers": [
      "Managed corporate agile and waterfall portfolios across horizontal lines of businesses",
      "Responsible for managing program-level change for two large integration portfolios using Clarity and VBA tools",
      "Automated and leaned enterprise processes using BPM certified process management tools"
    ]
  }, {
    "job": "Software Engineer",
    "loc": "Richmond, VA",
    "level": "Associate",
    "company": "Capital One",
    "timeFrame": "Jun 2011 - Jun 2012",
    "qualifiers": [
      "Created enterprise, customer-facing middleware web services",
      "Responsible for developing middleware integration services and mapping native to canonical data models in code",
      "Provided frequent feedback to external data modeling software company based on our end-user experience of software",
      "Successfully operated in a agile team of new-but-growing agile maturity"
    ]
  }, {
    "job": "Other Work Experience",
    "qualifiers": [
      {
        "inlineJob" : [
          "Counter Operations",
          "Best Buy Geek Squad",
          "State College, PA",
          "Jun 2009 - May 2011"
        ]
      }, {
        "inlineJob" : [
          "Learning Assistant",
          "IST, Penn State University",
          "State College, PA",
          "Jan 2010 - May 2011"
        ]
      }
    ]
  }]
}, {
  "section": "edu",
  "highlights": [{
    "job": "Pennsylvania State University",
    "timeFrame": "Graduated May 2011",
    "qualifiers": [
      "B.S. in Information Science and Technology, focused in Information Systems",
      "B.A. in Psychology",
      "<em>Extracurricular:</em> 4 years in the PSU Marching Blue Band"
    ]
  }]
}, {
  "section": "certs",
  "highlights": [{
    "qualifiers": [
      "Certifications: BPM",
      "Development Methodologies/Tools:  Scrum Agile | Kanban | Gemba | Toyota/Shingo Practices | Design-Oriented Thinking | Trainer and Public Speaking experience",
      "Elementary-level Japanese language"
    ]
  }]
}]
